### 데이터프레임 원소에 함수 매핑 
- df의 개별 원소에 특정 함수 매핑 : applymap() 메소드 사용
- 매핑 함수에 df의 각 원소를 하나씩 넣어 리턴값으로 받음
- 원소의 원래 위치에 매핑 함수의 리턴값 입력하여 동일한 형태의 df 생성
- df의 원소에 함수 매핑 : DataFrame 객체.applymap(매핑 함수)

In [1]:
import seaborn as sns 

titanic = sns.load_dataset('titanic')
df = titanic.loc[:, ['age', 'fare']]

df['ten'] = 10
df.head()

    age     fare  ten
0  22.0   7.2500   10
1  38.0  71.2833   10
2  26.0   7.9250   10
3  35.0  53.1000   10
4  35.0   8.0500   10

In [2]:
def add_10(n) : 
    return n + 10 

df_map = df.applymap(add_10)
df_map.head()

    age     fare  ten
0  32.0  17.2500   20
1  48.0  81.2833   20
2  36.0  17.9250   20
3  45.0  63.1000   20
4  45.0  18.0500   20